<?php
/**
 * Created by PhpStorm.
 * User: sasha
 * Date: 12.08.16
 * Time: 16:29
 * Уяви, що ти секретний агент в тилу ворога. Ти вирішив скористатися
 * отриманими в уроках знаннями для створення програми шифрування і розшифровки
 * тексту.
 */

//Код для заміни букв
$code = array(
  'а' => '1',
  'б' => '2',
  'в' => '3',
  'г' => '4',
  'д' => '5',
  'е' => '6',
  'є' => '7',
  'ж' => '8',
  'з' => '9',
  'і' => '0',
  'й' => '#',
  'ї' => '!',
  'к' => '@',
  'л' => '$',
  'м' => '%',
  'н' => '*',
  'о' => '(',
  'п' => ')',
  'р' => '_',
  'с' => '-',
  'т' => '=',
  'у' => '+',
  'ф' => '``',
  'х' => '~',
  'ц' => '/',
  'ч' => '""',
  'ш' => ';',
  'щ' => ':',
  'ь' => ']',
  'ю' => '}',
  'я' => '<',
  'и' => '|',
);

$text = "листівку прийшлось зашифрувати, щоб ворог не здогадався, що в ній написано";

//Шифрування тексту
$cipher = strtr($text, $code);
echo "Оригінал текста : {$text}<br>Шифровка : {$cipher}<br>";

//Замінна ключів на значення
$alteration = array_flip($code);

//Дешифрування
$transformation = strtr($cipher, $alteration);
echo "Дешифровка : {$transformation}";
