<?php
/**
 * Created by PhpStorm.
 * User: sasha
 * Date: 15.08.16
 * Time: 10:22
 *  *Умова і гра в кубики
 * Давай тепер зробимо гру з 2 кубиками. Людина і ІІ (штучний інтелект, тобто
 * робот) кидають по 2 кубики, і той, у кого сума чисел більше, переміг (якщо
 * однакова - перемогла дружба). Тобто, у людини випало 6 + 6, це 12, у робота
 * випало 1 + 3 = 4, людина переміг. Якщо у людини і ІІ випали дабл (однакові
 * числа на обох кубиках), то це велика удача, нічия і сенсу грати далі немає.
 */
$user1 = mt_rand(1, 6);
$user2 = mt_rand(1, 6);
$comp1 = mt_rand(1, 6);
$comp2 = mt_rand(1, 6);
$userSum = $user1 + $user2;
$compSum = $comp1 + $comp2;
echo "У ігрока випало : {$user1} і {$user2} а у комп'ютора випало : {$comp1} і {$comp2}<br>";
//if (($user1 == $comp1 && $user1 == $comp2) && ($user2 == $comp1 && $user2 == $comp2)) {
if ($user1 == $user2 && $comp1 == $comp2 && $userSum == $compSum) {
  echo "Якщо у  ігрока випало : {$user1} і {$user2} і у комп'ютора випало : {$comp1} і {$comp2}. Виграла дружба<br>";
}
elseif ($userSum > $compSum) {
  echo 'Вмграв ігрок <br>';
}
elseif ($userSum == $compSum) {
  echo 'Випала однакова сума чисел потрібно кинути кубики ще раз';
}
else {
  echo "Виграв комп'ютор <br>";
}
