<?php
/**
 * Created by PhpStorm.
 * User: sasha
 * Date: 08.08.16
 * Time: 7:36
 * Хтось кладе в банк 10000 р. Банк нараховує 10% річних (тобто, кожен рік на
 * рахунку стає на 10% більше, ніж в минулому році). Напиши програму, яка
 * рахує, через скільки років в банку буде мільйон? Скільки років буде цьому
 * хтось? Чи доживе хтось до цього дня, якщо сьогодні йому 16 років?
 */

//Сума вкладу user
$userBalance = 10000;
//10% що  дає банк
$interest = 0.1;
//Вік user
$userAge = 16;

if ($userBalance) {
  $sunInterest = $userBalance * $interest;
  echo "Сума вкладу : {$userBalance} руб.<br>";
  echo "Сума : {$sunInterest} руб. виплачена за перший рік  в розмірі 10% від суми вклада.<br>";
}
// Робимо збільшення з 10000р. до 1000000р.
for ($a = 10000; $a < 1000000; $a *= 1.10) {
}
//echo $a . '<br>';
//Визначаємо за скільки років накопичеться 1000000р.
if ($a && $userBalance) {
  $sumYears = log($a / $userBalance) / log(1 + $interest);
  $age = $userAge + $sumYears;
  echo " Сума : {$a} руб. виплачена за : {$sumYears} років <br>";
  echo "Отже, якщо зараз Useru : {$userAge} років, то мільйон він отримає в : {$userAge} років + {$sumYears} років = {$age} років. ";
}
