<?php
/**
 * Created by PhpStorm.
 * User: sasha
 * Date: 10.08.16
 * Time: 8:19
 * Школяр вирішив купити айфон і для цієї мети взяв кредит. Сума кредиту -
 * 40000 р., Банк на початку кожного місяця (включаючи перший) нараховує 3% від
 * залишку боргу за користування кредитом та 1000 р. комісії (так, а ти думав,
 * обійдешся відсотками?). Після цього, в кінці кожного місяця, наш герой йде в
 * банк і намагається виплатити борг, але він не може заплатити більше 5000 р
 * за раз (зекономлених на шкільних сніданках). Питання, коли він позбудеться
 * від боргу? У скільки школяреві обійшовся айфон?
 */
// Борг Юзера перед банком
$creditBalance = 40000;
//  Банк нараховує 3% в місяць від суми
$percent = 1.03;
// А також 1000 руб. в місяць комісії
$servicePayment = 1000;
// Юзер платить 5000 руб. в місяць
$monthlyPayment = 5000;
// Скільки всього відав банку Юзер
$paymentTotal = 0;

// Підраховуємо витрати за 20 місяців вперед
for ($month = 1; $month <= 20; $month++) {
  //Робимо розрахуно : який залишок боргу і скільки виплатив Юзер
  $creditBalance = ($creditBalance * $percent) + $servicePayment - $monthlyPayment;
  $paymentTotal = $paymentTotal + $monthlyPayment;
  echo "{$month} місяць потому : борг = {$creditBalance} руб. выплачено всего :{$paymentTotal} руб. <br>";

  // Якщо баланс від'ємний - перериваємо цикл
  if ($creditBalance < 0) {
    $paymentTotal = $paymentTotal + $creditBalance;
    echo "З Юзера досить! Це остання виплата по кредиту : $paymentTotal<br>";
    break;
  }
}
