<?php
/**
 * Created by PhpStorm.
 * User: sasha
 * Date: 10.08.16
 * Time: 8:19
 * Школяр вирішив купити айфон і для цієї мети взяв кредит. Сума кредиту -
 * 40000 р., Банк на початку кожного місяця (включаючи перший) нараховує 3% від
 * залишку боргу за користування кредитом та 1000 р. комісії (так, а ти думав,
 * обійдешся відсотками?). Після цього, в кінці кожного місяця, наш герой йде в
 * банк і намагається виплатити борг, але він не може заплатити більше 5000 р
 * за раз (зекономлених на шкільних сніданках). Питання, коли він позбудеться
 * від боргу? У скільки школяреві обійшовся айфон?
 */
// Кредит виданий банком Юзеру
$credit_balance = 40000;
//Ставка по кредиту - 3%
$percent = 1.03;
//Комісія банку 1000 руб.
$commission = 1000;
// Юзер сплачує, щомісячно 5000 руб. в місяць
$monthly_payment = 5000;
// Сума сплати Юзера в банк
$sum_payment = 0;

// Підраховуємо витрати за 20 місяців вперед
for ($month = 1; $month <= 20; $month++) {
  //Робимо розрахунок : який залишок боргу і скільки виплатив Юзер
  $credit_balance = ($credit_balance * $percent) + $commission - $monthly_payment;
  $sum_payment = $sum_payment + $monthly_payment;
  echo "Борг {$month} місяць : {$credit_balance} руб. Сплачено банку : {$sum_payment} руб. <br>";

  // Якщо баланс від'ємний - перериваємо цикл
  if ($credit_balance < 0) {
    $sum_payment = $sum_payment + $credit_balance;
    echo "Через 13 місяців Юзер позбавиться боргу. IPhone обійшовся в : {$sum_payment} руб.<br>";
    break;
  }
}
