<?php
/**
 * Created by PhpStorm.
 * User: sasha
 * Date: 11.08.16
 * Time: 8:41
 * Давай зробимо програму, що відповідає на будь-яке питання. Для цього
 * створимо масив з можливими варіантами відповідей, згенеруємо випадкове число
 * і візьмемо з масиву елемент з таким номером.
 */
//Відповіді
$answers = array(
  1 => 'Так',
  2 => 'Ні',
  3 => 'Ніхто не знає',
  4 => 'Все залежить від Саши',
  5 => 'Ніколи',
  6 => 'Треба запитати у Льошика',
);

//Запитання
$question = 'Чи зможе Саша вивчити PHP ?';

//Випадкове число
$random = array_rand($answers);

//Порівняння ключів масиву з випадковим числом
foreach ($answers as $key => $values) {
  if ($random == $key) {
    echo "{$question}<br>";
    echo "{$random} . {$values}";
  }
}
