<?php
/**
 * Created by PhpStorm.
 * User: sasha
 * Date: 11.08.16
 * Time: 7:28
 * Даний зріст школяра і зріст його однокласників. Треба знайти, скільки людей
 * в класі вище, ніж наш герой.
 */
//Зріст Юзера
$height_user = 169;

//Зріст однокласників Юзера
$classmates = array(
  'Антон' => 172,
  'Семен' => 165,
  'Лена' => 189,
  'Іван' => 171,
  'Петро' => 182,
  'Вася' => 176,
  'Аня' => 180,
  'Таня' => 179,
  'Маня' => 171,
);
//Кількість однокласників вищих за Юзера
$number = 0;

//Перебираємо всіх однокласників
foreach ($classmates as $name => $height) {
  echo "Ім'я : {$name}, зріст : {$height} см.<br>";

  if ($height > $height_user) {
    $number++;
  }
}
echo "В класі {$number} однокласників вище Юзера";
